/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright(c) 2017 Nuvoton Technology Corp. All rights reserved.                                         */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/

//***********************************************************************************************************
//  Nuvoton Technoledge Corp. 
//  Website: http://www.nuvoton.com
//  E-Mail : MicroC-8bit@nuvoton.com
//  Date   : Apr/21/2017
//***********************************************************************************************************

//***********************************************************************************************************
//  File Function: N76E003 Timer0/1 Mode1 demo code
//***********************************************************************************************************

#include "N76E003.h"
#include "Common.h"
#include "Delay.h"
#include "SFR_Macro.h"
#include "Function_define.h"


void Timer0_Init(void)                //定时器0初始化
{
	TIMER0_MODE1_ENABLE;               //定时器0  模式1
	clr_T0M;                           //选择12分频
	TH0 = (TIMER_DIV12_VALUE_1ms)/256; //1ms初值高八位
	TL0 = (TIMER_DIV12_VALUE_1ms)%256; //1ms初值第八位
	set_ET0;                           //开启定时器0中断
	set_TR0;                           //定时器0启动
}





